# Библиотека Pandas

## Data Frame

In [1]:
import pandas as pd

In [4]:
#создание DataFrame по столбцам с помощью словарей
frame = pd.DataFrame({'numbers':range(10), 'chars':['a']*10})
jopa = pd.DataFrame({'id':range(1,11), 'email': ['Ochir.Basangov@ru.ey.com']*10})
jopa

   id                     email
0   1  Ochir.Basangov@ru.ey.com
1   2  Ochir.Basangov@ru.ey.com
2   3  Ochir.Basangov@ru.ey.com
3   4  Ochir.Basangov@ru.ey.com
4   5  Ochir.Basangov@ru.ey.com
5   6  Ochir.Basangov@ru.ey.com
6   7  Ochir.Basangov@ru.ey.com
7   8  Ochir.Basangov@ru.ey.com
8   9  Ochir.Basangov@ru.ey.com
9  10  Ochir.Basangov@ru.ey.com

In [10]:
print(jopa.columns)
print(jopa.shape)

Index(['id', 'email'], dtype='object')
(10, 2)

In [7]:
#создание DataFrame с помощью чтения данных из файла
frame = pd.read_csv('dataset.tsv', header=0, sep='\t')
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [8]:
frame.columns

Index(['Name', 'Birth', 'City', 'Position'], dtype='object')

In [9]:
frame.shape

(6, 4)

In [11]:
new_line = {'Name':'Perov', 'Birth':'22.03.1990', 'City':'Penza'}
botaev = {'id': '11', 'email': 'Botaev@VSK.ru'}
jopa = jopa.append(botaev, ignore_index = True)
jopa

    id                     email
0    1  Ochir.Basangov@ru.ey.com
1    2  Ochir.Basangov@ru.ey.com
2    3  Ochir.Basangov@ru.ey.com
3    4  Ochir.Basangov@ru.ey.com
4    5  Ochir.Basangov@ru.ey.com
5    6  Ochir.Basangov@ru.ey.com
6    7  Ochir.Basangov@ru.ey.com
7    8  Ochir.Basangov@ru.ey.com
8    9  Ochir.Basangov@ru.ey.com
9   10  Ochir.Basangov@ru.ey.com
10  11             Botaev@VSK.ru

In [12]:
#добавление строки в DataFrame
frame.append(new_line, ignore_index=True)

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6            Perov  22.03.1990      Penza       NaN

In [13]:
#добавление строки в DataFrame
frame = frame.append(new_line, ignore_index=True)

In [14]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6            Perov  22.03.1990      Penza       NaN

In [15]:
#добавление столбца в DataFrame
frame['IsStudent'] = [False]*5 + [True]*2

In [16]:
frame

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN      False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      False
2       Белов М.М.  13.02.1980     Ростов  менеджер      False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      False
4      Рыбина Е.П.  19.11.1985     Москва   инженер      False
5     Костров С.О.  31.05.1985     Москва    стажер       True
6            Perov  22.03.1990      Penza       NaN       True

In [20]:
jopa.drop('IsLoh', axis=1, inplace = True) #axis = 1 это столбцы, axis = 0 это строки
jopa['IsLoh'] = [True]*10 + [False]
jopa

    id                     email  IsLoh
0    1  Ochir.Basangov@ru.ey.com   True
1    2  Ochir.Basangov@ru.ey.com   True
2    3  Ochir.Basangov@ru.ey.com   True
3    4  Ochir.Basangov@ru.ey.com   True
4    5  Ochir.Basangov@ru.ey.com   True
5    6  Ochir.Basangov@ru.ey.com   True
6    7  Ochir.Basangov@ru.ey.com   True
7    8  Ochir.Basangov@ru.ey.com   True
8    9  Ochir.Basangov@ru.ey.com   True
9   10  Ochir.Basangov@ru.ey.com   True
10  11             Botaev@VSK.ru  False

In [21]:
#удаление строк DataFrame
frame.drop([5,6], axis=0)

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN      False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      False
2       Белов М.М.  13.02.1980     Ростов  менеджер      False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      False
4      Рыбина Е.П.  19.11.1985     Москва   инженер      False

In [22]:
frame

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN      False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      False
2       Белов М.М.  13.02.1980     Ростов  менеджер      False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      False
4      Рыбина Е.П.  19.11.1985     Москва   инженер      False
5     Костров С.О.  31.05.1985     Москва    стажер       True
6            Perov  22.03.1990      Penza       NaN       True

In [23]:
#удаление строк DataFrame (inplace)
frame.drop([5,6], axis=0, inplace=True)

In [24]:
frame

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN      False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      False
2       Белов М.М.  13.02.1980     Ростов  менеджер      False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      False
4      Рыбина Е.П.  19.11.1985     Москва   инженер      False

In [25]:
#удаление столбца DataFrame (inplace)
frame.drop('IsStudent', axis=1, inplace=True)

In [26]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер

In [32]:
#запись DataFrame в файл
import codecs
frame.to_csv('updated_dataset.csv', sep=',', encoding = 'windows-1251', header=True, index=False)
jopa.to_csv('updated_jopa.csv', sep=',', header = True, index = False)
#index = False - без индекса, header = True - с заголовками столбцов

In [29]:
!cat updated_dataset.csv #для макбуков крч ИОС)))

"cat" ­Ґ пў«пҐвбп ў­гваҐ­­Ґ© Ё«Ё ў­Ґи­Ґ©
Є®¬ ­¤®©, ЁбЇ®«­пҐ¬®© Їа®Ја ¬¬®© Ё«Ё Ї ЄҐв­л¬ д ©«®¬.

In [33]:
#аналог команды для пользователей Windows
!more updated_dataset.csv

Name,Birth,City,Position
Иванов А.А.,22.03.1980,Москва,
Сорокин И.В.,07.08.1965,Волгоград,инженер
Белов М.М.,13.02.1980,Ростов,менеджер
Мельникова Д.С.,15.04.1985,Ростов,
Рыбина Е.П.,19.11.1985,Москва,инженер

# Индексация и селекция

In [1]:
#Pandas. Индексация и селекция
import pandas as pd
import codecs
frame = pd.read_csv('dataset.tsv', sep = '\t', header = 0)
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Birth     6 non-null      object
 2   City      6 non-null      object
 3   Position  4 non-null      object
dtypes: object(4)
memory usage: 320.0+ bytes

In [2]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [3]:
frame.fillna('разнорабочий', inplace = True) #замена пропусков
frame

              Name       Birth       City      Position
0      Иванов А.А.  22.03.1980     Москва  разнорабочий
1     Сорокин И.В.  07.08.1965  Волгоград       инженер
2       Белов М.М.  13.02.1980     Ростов      менеджер
3  Мельникова Д.С.  15.04.1985     Ростов  разнорабочий
4      Рыбина Е.П.  19.11.1985     Москва       инженер
5     Костров С.О.  31.05.1985     Москва        стажер

In [4]:
frame.Position #столбец в виде серии series

0    разнорабочий
1         инженер
2        менеджер
3    разнорабочий
4         инженер
5          стажер
Name: Position, dtype: object

In [5]:
frame[['Position']] #столбец в виде датафрейма

       Position
0  разнорабочий
1       инженер
2      менеджер
3  разнорабочий
4       инженер
5        стажер

In [44]:
frame[['Name', 'Position']]

              Name      Position
0      Иванов А.А.  разнорабочий
1     Сорокин И.В.       инженер
2       Белов М.М.      менеджер
3  Мельникова Д.С.  разнорабочий
4      Рыбина Е.П.       инженер
5     Костров С.О.        стажер

In [6]:
print(frame.head(3)) #первые 3 строки
print()
print(frame[:3]) #первые 3 строки
print()
print(frame[::-1]) #обратный порядок
print()
print(frame[::2]) #через 2
print()
print(frame[-3:]) #-3 это последние 3 строки

           Name       Birth       City      Position
0   Иванов А.А.  22.03.1980     Москва  разнорабочий
1  Сорокин И.В.  07.08.1965  Волгоград       инженер
2    Белов М.М.  13.02.1980     Ростов      менеджер

           Name       Birth       City      Position
0   Иванов А.А.  22.03.1980     Москва  разнорабочий
1  Сорокин И.В.  07.08.1965  Волгоград       инженер
2    Белов М.М.  13.02.1980     Ростов      менеджер

              Name       Birth       City      Position
5     Костров С.О.  31.05.1985     Москва        стажер
4      Рыбина Е.П.  19.11.1985     Москва       инженер
3  Мельникова Д.С.  15.04.1985     Ростов  разнорабочий
2       Белов М.М.  13.02.1980     Ростов      менеджер
1     Сорокин И.В.  07.08.1965  Волгоград       инженер
0      Иванов А.А.  22.03.1980     Москва  разнорабочий

          Name       Birth    City      Position
0  Иванов А.А.  22.03.1980  Москва  разнорабочий
2   Белов М.М.  13.02.1980  Ростов      менеджер
4  Рыбина Е.П.  19.11.1985  Москва       инженер

              Name       Birth    City      Position
3  Мельникова Д.С.  15.04.1985  Ростов  разнорабочий
4      Рыбина Е.П.  19.11.1985  Москва       инженер
5     Костров С.О.  31.05.1985  Москва        стажер

In [57]:
frame.loc[ [1,3,5], ['Name', 'Birth'] ]

              Name       Birth
1     Сорокин И.В.  07.08.1965
3  Мельникова Д.С.  15.04.1985
5     Костров С.О.  31.05.1985

In [59]:
frame.iloc[ [1,3,5], [0,2] ] #.iloc requires numeric indexers

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [60]:
print(frame.ix[ [1,3,5], ['Name', 'Birth'] ]) #ix не работает
print()
print(frame.ix[ [1,3,5], [0,2] ])

AttributeError: 'DataFrame' object has no attribute 'ix'

In [63]:
print(frame.loc[ [1,3,5], ['Name', 'Birth'] ])
print()
print(frame.iloc[ [1,3,5], [0,2] ])

              Name       Birth
1     Сорокин И.В.  07.08.1965
3  Мельникова Д.С.  15.04.1985
5     Костров С.О.  31.05.1985

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [65]:
frame[frame.Birth >= '1985.01.01']

           Name       Birth    City      Position
0   Иванов А.А.  22.03.1980  Москва  разнорабочий
5  Костров С.О.  31.05.1985  Москва        стажер

In [79]:
jopa = frame[:2]
jopa['IsLoh'] = [False, True] #так норм ХЫ
jopa

<ipython-input-79-33a755d8f07d>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  jopa['IsLoh'] = [False, True]

           Name       Birth       City      Position  IsLoh
0   Иванов А.А.  22.03.1980     Москва  разнорабочий  False
1  Сорокин И.В.  07.08.1965  Волгоград       инженер   True

In [80]:
jopa = frame[:2]
jopa['IsLoh'] = [False], [True] #нельзя так!
jopa

<ipython-input-80-db5559e923cb>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  jopa['IsLoh'] = [False], [True]

           Name       Birth       City      Position     IsLoh
0   Иванов А.А.  22.03.1980     Москва  разнорабочий  (False,)
1  Сорокин И.В.  07.08.1965  Волгоград       инженер   (True,)

In [82]:
jopa = frame[:2]
jopa['IsLoh'] = [False] + [True] #норм
jopa

<ipython-input-82-3fd01e0ae587>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  jopa['IsLoh'] = [False] + [True]

           Name       Birth       City      Position  IsLoh
0   Иванов А.А.  22.03.1980     Москва  разнорабочий  False
1  Сорокин И.В.  07.08.1965  Волгоград       инженер   True

In [12]:
#выбираем строки, удовлетворяющие пересечению (конъюнкция) условий
frame[(frame.Birth >= '01.01.1985') & (frame.City != 'Москва')]

              Name       Birth       City      Position
1     Сорокин И.В.  07.08.1965  Волгоград       инженер
2       Белов М.М.  13.02.1980     Ростов      менеджер
3  Мельникова Д.С.  15.04.1985     Ростов  разнорабочий

In [13]:
#выбираем строки, удовлетворяющие объединению (дизъюнкция) условий
frame[(frame.Birth >= '01.01.1985') | (frame.City == 'Волгоград')]

              Name       Birth       City      Position
0      Иванов А.А.  22.03.1980     Москва  разнорабочий
1     Сорокин И.В.  07.08.1965  Волгоград       инженер
2       Белов М.М.  13.02.1980     Ростов      менеджер
3  Мельникова Д.С.  15.04.1985     Ростов  разнорабочий
4      Рыбина Е.П.  19.11.1985     Москва       инженер
5     Костров С.О.  31.05.1985     Москва        стажер

---

# Markdown
# Learn How to Write Markdown & LaTeX in The Jupyter Notebook

---

https://towardsdatascience.com/write-markdown-latex-in-the-jupyter-notebook-10985edb91fd

Emphasis, aka italics, with *asterisks* (*) or _underscores_ (_)

Strong emphasis, aka bold, with **asterisks** (**) or __underscores__ (__).

Combined emphasis with **asterisks and _underscores_**.

Strikethrough uses two tildes ~ . ~~Scratch this.~~ (~~)

In [ ]:
$$
\frac{arg 1}{arg 2} \\
x^2\\
e^{i\pi}\\
A_i\\
B_{ij}\\
\sqrt[n]{arg}
$$

$$
\frac{arg 1}{arg 2} \\
x^2\\
e^{i\pi}\\
A_i\\
B_{ij}\\
\sqrt[n]{arg}	
$$

In [ ]:
Given : $\pi = 3.14$ , $\alpha = \frac{3\pi}{4}\, rad$
$$
\omega = 2\pi f \\
f = \frac{c}{\lambda}\\
\lambda_0=\theta^2+\delta\\
\Delta\lambda = \frac{1}{\lambda^2}
$$

Given : $\pi = 3.14$ , $\alpha = \frac{3\pi}{4}\, rad$
$$
\omega = 2\pi f \\
f = \frac{c}{\lambda}\\
\lambda_0=\theta^2+\delta\\
\Delta\lambda = \frac{1}{\lambda^2}
$$

In [ ]:
                                                            \delta >>> δ 
                                                            \Delta >>> Δ
                                                            \omega >>> ω
                                                            \Omega >>> Ω

$$
\delta \\
\Delta \\
\omega \\
\Omega \\
$$

In [ ]:
$$
\sin(-\alpha)=-\sin(\alpha)\\
\arccos(x)=\arcsin(u)\\
\log_n(n)=1\\
\tan(x) = \frac{\sin(x)}{\cos(x)}
$$

$$
\sin(-\alpha)=-\sin(\alpha)\\
\arccos(x)=\arcsin(u)\\
\log_n(n)=1\\
\tan(x) = \frac{\sin(x)}{\cos(x)}
$$

In [ ]:
Other Symbols
## Angles:
Left angle : $\langle$

Right angle : $\rangle$

Angle between two vectors u and v	: $\langle \vec{u},\vec{v}\rangle$	

$$ \vec{AB} \, \cdot \, \vec{CD} =0  \Rightarrow  \vec{AB} \, \perp\, \vec{CD}$$

##Sets and logic
$$\mathbb{N} \subset \mathbb{Z} \subset \mathbb{D} \subset \mathbb{Q} \subset \mathbb{R} \subset \mathbb{C}$$

Other Symbols
### Angles:
Left angle : $\langle$

Right angle : $\rangle$

Angle between two vectors u and v	: $\langle \vec{u},\vec{v}\rangle$	

$$ \vec{AB} \, \cdot \, \vec{CD} =0  \Rightarrow  \vec{AB} \, \perp\, \vec{CD}$$

##Sets and logic
$$\mathbb{N} \subset \mathbb{Z} \subset \mathbb{D} \subset \mathbb{Q} \subset \mathbb{R} \subset \mathbb{C}$$

In [ ]:
$$
\underbrace{\ln \left( \frac{5}{6} \right)}_{\simeq -0.1823}
< \overbrace{\exp (2)}^{\simeq 7.3890}
$$

$$
\underbrace{\ln \left( \frac{5}{6} \right)}_{\simeq -0.1823}
< \overbrace{\exp (2)}^{\simeq 7.3890}
$$

In [ ]:
First order derivative : $$f'(x)$$ 
K-th order derivative  : $$f^{(k)}(x)$$
Partial firt order deivative: $$\frac{\partial f}{\partial x}$$
Partial k-th order derivative: $$\frac{\partial^{k} f}{\partial x^k}$$

First order derivative : $$f'(x)$$ 
K-th order derivative  : $$f^{(k)}(x)$$
Partial firt order deivative	: $$\frac{\partial f}{\partial x}$$
Partial k-th order derivative	: $$\frac{\partial^{k} f}{\partial x^k}$$

In [ ]:
Sum from 0 to +inf:

$$\sum_{j=0}^{+\infty} A_{j}$$

Double sum:
$$\sum^k_{i=1}\sum^{l+1}_{j=1}\,A_i A_j$$


Taylor expansion of $e^x$:
$$ e^x  = \sum_{k=0}^{n}\, \frac{x^k}{k!} + o(x^n) $$

Sum from 0 to +inf:

$$\sum_{j=0}^{+\infty} A_{j}$$

Double sum:
$$\sum^k_{i=1}\sum^{l+1}_{j=1}\,A_i A_j$$	


Taylor expansion of $e^x$:
$$ e^x  = \sum_{k=0}^{n}\, \frac{x^k}{k!} + o(x^n) $$

In [ ]:
Product:
$$\prod_{j=1}^k A_{\alpha_j}$$
Double product:
$$\prod^k_{i=1}\prod^l_{j=1}\,A_i A_j$$

Product:
$$\prod_{j=1}^k A_{\alpha_j}$$
Double product:
$$\prod^k_{i=1}\prod^l_{j=1}\,A_i A_j$$

In [ ]:
Simple integral:
$$\int_{a}^b f(x)dx$$

Double integral:
$$\int_{a}^b\int_{c}^d f(x,y)\,dxdy$$

Triple integral:
$$\iiint$$

Quadruple integral:
$$\iiiint$$

Multiple integral :
$$\idotsint$$

Contour integral:
$$\oint$$

Simple integral:
$$\int_{a}^b f(x)dx$$

Double integral:
$$\int_{a}^b\int_{c}^d f(x,y)\,dxdy$$	

Triple integral:
$$\iiint$$	

Quadruple integral:
$$\iiiint$$	

Multiple integral :
$$\idotsint$$

Contour integral:
$$\oint$$

In [ ]:
Plain:

\begin{matrix}
1 & 2 & 3\\
a & b & c
\end{matrix}

Round brackets:
\begin{pmatrix}
1 & 2 & 3\\
a & b & c
\end{pmatrix}

Curly brackets:
\begin{Bmatrix}
1 & 2 & 3\\
a & b & c
\end{Bmatrix}

Pipes:
\begin{vmatrix}
1 & 2 & 3\\
a & b & c
\end{vmatrix}

Double pipes
\begin{Vmatrix}
1 & 2 & 3\\
a & b & c
\end{Vmatrix}

Plain:

\begin{matrix}
1 & 2 & 3\\
a & b & c
\end{matrix}

Round brackets:
\begin{pmatrix}
1 & 2 & 3\\
a & b & c
\end{pmatrix}

Curly brackets:
\begin{Bmatrix}
1 & 2 & 3\\
a & b & c
\end{Bmatrix}	

Pipes:
\begin{vmatrix}
1 & 2 & 3\\
a & b & c
\end{vmatrix}

Double pipes
\begin{Vmatrix}
1 & 2 & 3\\
a & b & c

\end{Vmatrix}

__The End__

-----

---

# Pandas - Работа с данными (Devpractice Team)

---

-----

__Series__ - маркированная одномерная структура данных, таблица с 1 строкой (или столбцом).

__DataFrame__ - двумерна маркированная структура, то есть обычная таблица.

Создать Series можно на базе:

- словарь (dict) Python

- список (list) 

- массив ndarray (из библиотеки numpy)

- скалярная величина

Series(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)

Опишем некоторые из параметров конструктора:

- __data__: массив, скалярное значение, dict; значение по умолчанию:
None

Структура, на базе которой будет построен Series.

- __index__: одномерный массив; значение по умолчанию: None

Список меток, который будет использоваться для доступа к
элементам Series. Длина списка должна быть равна длине data.

- __dtype__: numpy.dtype; значение по умолчанию: None

Объект, определяющий тип данных.

- __copy__: bool; значение по умолчанию: False

Если параметр равен True, то будет создана копия массива
данных.

В большинстве случаев, при создании Series, используют только
первые два параметра

In [2]:
import pandas as pd

s1 = pd.Series([1, 2, 3, 4, 5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
s2 = pd.Series([1, 2, 3, 4 ,5], ['a', 'b', 'c', 'd', 'e'])
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

---

_**Создание Series из ndarray массива из numpy**_

In [5]:
import numpy as np

ndarr = np.array([1, 2, 3, 4, 5])
type(ndarr)

numpy.ndarray

In [6]:
s3 = pd.Series(ndarr, ['a', 'b', 'c', 'd', 'e'])
s3

a    1
b    2
c    3
d    4
e    5
dtype: int32

_**Создание Series из словаря (dict)**_

In [7]:
d = {'a': 1, 'b': 2, 'c': 3}
s4 = pd.Series(d)
s4

a    1
b    2
c    3
dtype: int64

_**Создание Series с использованием константы**_

In [8]:
a = 7
s5 = pd.Series(a, ['a', 'b', 'c', 'd', 'e'])
s5

a    7
b    7
c    7
d    7
e    7
dtype: int64

_**Работа с элементами Series**_

In [9]:
s6 = pd.Series([1, 2, 3, 4, 5], ['a', 'b', 'c', 'd', 'e'])
s6[2]

3

In [15]:
print( s6['a'] )
print( s6.loc['a'] )

1
1

In [17]:
print( s6[2] )
print( s6.iloc[2] )

3
3

In [18]:
s6[:2] #0 и 1 элементы

a    1
b    2
dtype: int64

In [19]:
s6[s6 <= 2]

a    1
b    2
dtype: int64

In [20]:
s7 = pd.Series([10, 20, 30, 40, 50], ['a', 'b', 'c', 'd', 'e'])

In [21]:
s6+s7

a    11
b    22
c    33
d    44
e    55
dtype: int64

In [22]:
s6*3

a     3
b     6
c     9
d    12
e    15
dtype: int64

_**Структура данных DataFrame**_

Конструктор класса DataFrame выглядит так:

DataFrame( data=None, index=None, columns=None, dtype=None, copy=False )

Параметры конструктора:

- **data**: ndarray, dict или DataFrame; значение по умолчанию: None

Данные, на базе которых будет создан DataFrame.

- **index**: одномерный массив; значение по умолчанию: None


Список меток для записей (имена строк таблицы).


- **columns**: одномерный массив; значение по умолчанию: None

Список меток для полей (имена столбцов таблицы).

- **dtype**: numpy.dtype; значение по умолчанию: None

Объект, определяющий тип данных.

- **copy**: bool; значение по умолчанию: False

Если параметр равен True, то будет создана копия массива
данных

---

**Структуру DataFrame можно создать на базе следующих типов данных:**
- словарь (dict), в качестве элементов которого могут выступать:
одномерные ndarray, списки, другие словари, структуры Series;
- двумерный ndarray;
- структура Series;
- другой DataFrame.

---

### Создание DataFrame из словаря

---

Для создания DataFrame будем использовать словарь, элементами
которого могут быть списки, структуры Series и т.д

In [4]:
import pandas as pd
import numpy as np

d = {'price': pd.Series([1, 2, 3], index = ['v1', 'v2', 'v3']), 'count' : pd.Series([10, 12, 7], index = ['v1', 'v2', 'v3'])}
d

{'price': v1    1
 v2    2
 v3    3
 dtype: int64,
 'count': v1    10
 v2    12
 v3     7
 dtype: int64}

In [5]:
df1 = pd.DataFrame(d)
df1

    price  count
v1      1     10
v2      2     12
v3      3      7

In [6]:
df1.index

Index(['v1', 'v2', 'v3'], dtype='object')

In [7]:
df1.columns

Index(['price', 'count'], dtype='object')

In [8]:
d2 = {'price': np.array([1, 2, 3]), 'count': np.array([10, 12, 7])}
d2

{'price': array([1, 2, 3]), 'count': array([10, 12,  7])}

In [9]:
df2 = pd.DataFrame(d2, index = ['v1', 'v2', 'v3'])
df2

    price  count
v1      1     10
v2      2     12
v3      3      7

### Создание DataFrame из списка словарей

---

До этого мы создавали DataFrame из словаря, элементами которого
были структуры Series, списки и массивы, сейчас мы создадим
DataFrame из списка, элементами которого являются словари.

In [10]:
import pandas as pd

d3 = [{'price': 3 , 'count': 8}, {'price': 4 , 'count': 11}]
d3

[{'price': 3, 'count': 8}, {'price': 4, 'count': 11}]

In [11]:
df3 = pd.DataFrame(d3)
df3

   price  count
0      3      8
1      4     11

In [13]:
df3.info

<bound method DataFrame.info of    price  count
0      3      8
1      4     11>

In [14]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   price   2 non-null      int64
 1   count   2 non-null      int64
dtypes: int64(2)
memory usage: 160.0 bytes

---

### Создание DataFrame из двумерного массива и работа с элементами DataFrame

---

Создать DataFrame можно также и из двумерного массива, в нашем
примере это будет ndarray из библиотеки numpy.

In [15]:
nda1 = np.array([[1,2,3], [10,20,30]])
nda1

array([[ 1,  2,  3],
       [10, 20, 30]])

In [16]:
df4 = pd.DataFrame(nda1)
df4

    0   1   2
0   1   2   3
1  10  20  30

---

# Работа с элементами DataFrame

---


Выбор столбца - df[col] - Series

Выбор строки по метке - df.loc[label] - Series

Выбор строки по индексу - df.iloc[loc] - Series

Срез по строкам - df[0:4] - DataFrame

Выбор строк, отвечающих условию - df[bool_vec] - DataFrame

In [23]:
nda1 = {'price': np.array([1,2,3]), 'count': np.array([10,20,30]) }
df = pd.DataFrame(nda1, index = ['a', 'b', 'c'])
df

   price  count
a      1     10
b      2     20
c      3     30

In [24]:
df['count']

a    10
b    20
c    30
Name: count, dtype: int32

In [25]:
df.loc['a']

price     1
count    10
Name: a, dtype: int32

In [27]:
df.iloc[1]

price     2
count    20
Name: b, dtype: int32

In [28]:
df[0:2]

   price  count
a      1     10
b      2     20

In [29]:
df[ df['count'] >= 20 ]

   price  count
b      2     20
c      3     30

---

# Глава 2. Доступ к данным в структурах pandas

---

## Два подхода получения доступа к данным в pandas

Первый способ основан на использовании меток, в этом случае работа ведется через __метод .loc__

Если вы обращаетесь к отсутствующей метке, то будет сгенерировано исключение KeyError. 

Такой подход позволяет
использовать:
- метки в виде отдельных символов ['a'] или чисел [5], числа
используются в качестве меток, если при создании структуры не
был указан список с метками;
- список меток ['a', 'b', 'c'];
- срез меток ['a':'c'];
- массив логических переменных;
- callable-функция с одним аргументом.

Второй способ основан на использовании целых чисел для доступа к данных, он предоставляется через __метод .iloc__

Если вы обращаетесь к
несуществующему элементу, то будет сгенерировано исключение
IndexError. 

Логика использования .iloc очень похожа на работу с .loc. 

При таком подходе можно использовать:
- отдельные целые числа для доступа к элементам структуры;
- массивы целых чисел [0, 1, 2];
- срезы целых чисел [1:4];
- массивы логических переменных;
- callable-функцию с одним аргументом.

В зависимости от типа структуры, будет меняться форма .loc:
- для Series, она выглядит так: s.loc[indexer];
- для DataFrame так: df.loc[row_indexer, column_indexer].

Создадим объекты типов **Series** и DataFrame, которые в дальнейшем
будут использованы нами для экспериментов.

In [30]:
s = pd.Series([10, 20, 30, 40, 50], ['a', 'b', 'c', 'd', 'e'])
s['a']

10

In [31]:
s

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [32]:
d = {'price':[1, 2, 3], 'count': [10, 20, 30], 'percent': [24, 51, 71]}
df = pd.DataFrame(d, index = ['a', 'b', 'c'])
df

   price  count  percent
a      1     10       24
b      2     20       51
c      3     30       71

In [36]:
print(s['a'], '\n')
print(s[['a', 'c', 'e']], '\n')
print(s['a':'c'])

10

a    10
c    30
e    50
dtype: int64

a    10
b    20
c    30
dtype: int64

---

**Доступ к данным структуры Series с использованием целочисленных индексов**

---

In [37]:
s = pd.Series([10, 20, 30, 40, 50], ['a', 'b', 'c', 'd', 'e'])
s[1]

20

In [38]:
s[[1, 2, 3]]

b    20
c    30
d    40
dtype: int64

In [39]:
s[:3]

a    10
b    20
c    30
dtype: int64

---

### Доступ к данным структуры Series с использованием callable-функции

---

In [41]:
s = pd.Series([10, 20, 30, 40, 50], ['a', 'b', 'c', 'd', 'e'])
s[lambda x: x >= 30]

c    30
d    40
e    50
dtype: int64

In [42]:
s[s > 30]

d    40
e    50
dtype: int64

---

### Доступ к данным структуры DataFrame

---

In [54]:
df = pd.DataFrame( {'price':[1, 2, 3], 'count': [10, 20, 30], 'percent': [24, 51, 71]}, index = ['a', 'b', 'c'])
df

   price  count  percent
a      1     10       24
b      2     20       51
c      3     30       71

In [49]:
df['count']

a    10
b    20
c    30
Name: count, dtype: int64

In [51]:
df[['count', 'price']]

   count  price
a     10      1
b     20      2
c     30      3

In [52]:
df['a':'b'] #метки ДО - ВКЛЮЧАЯ

   price  count  percent
a      1     10       24
b      2     20       51

In [53]:
df[lambda x: x['count'] >= 15]

   price  count  percent
b      2     20       51
c      3     30       71

In [55]:
df[ df['price'] >=2 ]

   price  count  percent
b      2     20       51
c      3     30       71

---

**Использование атрибутов для доступа к данным** (стр. 27)

---

In [6]:
import pandas as pd
import numpy as np

s = pd.Series([1, 2, 3, 4, 5], ['a', 'b', 'c', 'd', 'e'])
print( s.a , '\n')
print( s['a'])

1

1

In [9]:
d = {'price': [1, 2, 3], 'count': [10, 20, 30], 'percent': [24, 51, 71]}
df = pd.DataFrame(d, index = ['a', 'b', 'c'])
df

   price  count  percent
a      1     10       24
b      2     20       51
c      3     30       71

In [11]:
print( df.price , '\n')
print( df['price'])

a    1
b    2
c    3
Name: price, dtype: int64

a    1
b    2
c    3
Name: price, dtype: int64

---

### Получение случайного набора из структур pandas

---

Библиотека pandas предоставляет возможность получить случайный набор данных из уже существующей структуры. Такой функционал
предоставляет как Series, так и DataFrame.

Случайная подвыборка, извлекается с помощью метода **sample()**.

Для начала разберем работу с этим методом на примере структуры
Series.

Для выбора случайного элемента из Series используется следующий
синтаксис

In [27]:
import pandas as pd
import numpy as np

s = pd.Series([1, 2, 3, 4, 5], ['a', 'b', 'c', 'd', 'e'])
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [45]:
print( s.sample() , '\n')
print( s.sample )

d    4
dtype: int64

<bound method NDFrame.sample of a    1
b    2
c    3
d    4
e    5
dtype: int64>

In [46]:
s.sample(n = 3)

d    4
b    2
e    5
dtype: int64

In [47]:
s.sample(frac = 0.3) # доля от общего числа объектов в структуре

b    2
a    1
dtype: int64

---

Мы можем передать вектор весов, длина которого должна быть равна количеству элементов в структуре, а
сумма элементов вектора - единице. 

Вес, в данном случае, это вероятность появления элемента в выборке.

---

In [113]:
s = pd.Series([1, 2, 3, 4, 5], ['a', 'b', 'c', 'd', 'e'])
w = [0.1, 0.1, 0.6, 0.1, 0.1] #60% на выпадение c = 3
s.sample(n = 4, weights = w)

c    3
e    5
d    4
a    1
dtype: int64

In [115]:
df = pd.DataFrame({'price':[1, 2, 3, 5, 6], 'count':[10, 20, 30, 40, 50], 'percent': [24, 51, 71, 25, 42]})
df

   price  count  percent
0      1     10       24
1      2     20       51
2      3     30       71
3      5     40       25
4      6     50       42

In [117]:
df.sample()

   price  count  percent
3      5     40       25

**При работе с DataFrame можно указать ось.**

In [175]:
df.sample( axis = 1 ) # n = 1 , axis = 0 - default

   percent
0       24
1       51
2       71
3       25
4       42

In [157]:
df.sample(n = 2, axis = 1 )

   percent  price
0       24      1
1       51      2
2       71      3
3       25      5
4       42      6

In [183]:
df.sample( n = 2 )

   price  count  percent
3      5     40       25
1      2     20       51

---

### Индексация с использованием логических выражений

---

In [184]:
s = pd.Series([10, 20, 30, 40, 50, 10, 10], ['a', 'b', 'c', 'd', 'e', 'f', 'g'])
s[ s > 30 ]

d    40
e    50
dtype: int64

In [185]:
s[ s == 10 ]

a    10
f    10
g    10
dtype: int64

In [187]:
s[ (s>= 30) & (s < 50) ]

c    30
d    40
dtype: int64

**При работе с DataFrame необходимо указывать столбец, по-которому будет производиться фильтрация**

In [189]:
d = {'price':[1, 2, 3, 5, 6], 'count': [10, 20, 30, 40, 50],
'percent': [24, 51, 71, 25, 42], 'cat': ['A', 'B', 'A', 'A', 'C']}
df = pd.DataFrame(d)
df

   price  count  percent cat
0      1     10       24   A
1      2     20       51   B
2      3     30       71   A
3      5     40       25   A
4      6     50       42   C

In [190]:
df[ df['price'] > 3 ]

   price  count  percent cat
3      5     40       25   A
4      6     50       42   C

В качестве логического выражения можно использовать довольно сложные конструкции с применением функций map, filter, lambda выражений и т.п.

Получим список индексов структуры df, у которых значение поля 'cat' равно 'A':

In [192]:
fn = df['cat'].map(lambda x: x == 'A') #fn - логическое выражение
df[fn]

   price  count  percent cat
0      1     10       24   A
2      3     30       71   A
3      5     40       25   A

**Использование isin при работы с данными в pandas**

In [193]:
s = pd.Series([10, 20, 30, 40, 50, 10, 10], ['a', 'b', 'c', 'd', 'e', 'f', 'g'])
s.isin([10, 20])

a     True
b     True
c    False
d    False
e    False
f     True
g     True
dtype: bool

In [194]:
df = pd.DataFrame({'price':[1, 2, 3, 5, 6], 'count': [10, 20, 30, 40, 50], 'percent': [24, 51, 71, 25, 42]})
df.isin([1, 3, 25, 30, 10])

   price  count  percent
0   True   True    False
1  False  False    False
2   True   True    False
3  False  False     True
4  False  False    False

In [197]:
df[['percent']].isin([1, 3, 25, 30, 10])

   percent
0    False
1    False
2    False
3     True
4    False

---

# Глава 3. Типы данных в pandas

---

При изучении любого языка программирования одной из важнейших тем, которую нужно освоить, является система типов. Например, при работе с языком Python вы сталкивались с такими типами как **int** и **float** для работы с числами, **str** - для работы со строками; 

есть типы более сложные, такие как списки, словари, множества. Библиотека pandas
содержит свой набор типов данных для эффективного хранения и
манипулирования данными. 

В предыдущих главах вы уже сталкивались с таким понятием как dtype: например, при выводе содержимого Series с помощью функции print, когда тип хранящихся значений отображается в последней строке.

In [198]:
s = pd.Series([1,2,3])
print(s)

0    1
1    2
2    3
dtype: int64

In [202]:
d = [{'name': 'pen', 'price': 3.9, 'count': 8}, {'name': 'book', 'price': 4.5, 'count': 11}]
df = pd.DataFrame(d)
df

   name  price  count
0   pen    3.9      8
1  book    4.5     11

In [203]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    2 non-null      object
 1   price   2 non-null      float64
 2   count   2 non-null      int64
dtypes: float64(1), int64(1), object(1)
memory usage: 176.0+ bytes

Типы данных
- int64 - 64 разрядное целочисленное значение, не зависит от платформы
- float64 - 64 разрядное число с плавающей точкой, не зависит от платформы
- object - Текст или любое другое значение
- bool - Булевое значение: True / False
- category - Конечное множество текстовых элементов
- datetime64[ns] - Дата / Время
- timedelta64[ns] - Разница между двумя datetime элементами

In [204]:
df.dtypes

name      object
price    float64
count      int64
dtype: object

Типы расширений pandas:
- DatetimeTZDtype - datetime c поддержкой часового пояса
- CategoricalDtype - Тип для категориальных данных (конечное множество
текстовых элементов)
- PeriodDtype - Тип для работы с периодическими данными
- SparseDtype - Тип для работы с разреженными данными
- IntervalDtype - Тип для работы с интервальными данными

---

Инструменты для работы с типами
**astype()**

Доступен как для структур Series, так и для DataFrame:

astype(self, dtype, copy=True, errors='raise', **kwargs)

- dtype: тип данных или словарь с именами столбцов

В качестве типа данных для приведения могут быть
использованы numpy.dtype, тип pandas, либо словарь в
формате {col: dtype, …}, где col - имя столбца, dtype -
желаемый тип данных.

- copy: bool; значение по умолчанию: True

astype будет возвращать копию структуры, если параметр
равен True, в ином случае будет модифицироваться текущая
структура.

- errors: {'raise', 'ignore'}; значение по умолчанию: 'raise'

Управляет процессом выброса исключений:

raise : разрешает выброс исключений;

ignore : игнорирует исключения.

-  \**kwargs

Аргументы для передачи конструктору

In [210]:
import pandas as pd
import numpy as np
s = pd.Series([1,2,3])
s.dtype

dtype('int64')

In [212]:
s.astype('float64')

0    1.0
1    2.0
2    3.0
dtype: float64

In [216]:
df = pd.DataFrame([{'name': 'pen', 'price': 3.9, 'count': 8}, {'name': 'book', 'price': 4.5, 'count': 11}])
print(df, '\n')
print(df.dtypes)

   name  price  count
0   pen    3.9      8
1  book    4.5     11

name      object
price    float64
count      int64
dtype: object

In [219]:
df = df.astype({'count':'int32'})
df.dtypes

name      object
price    float64
count      int32
dtype: object

In [220]:
df['count'] = df['count'].astype('int64')
df.dtypes

name      object
price    float64
count      int64
dtype: object

---

#### Функции подготовки данных

---

Часто возникает задача предварительной подготовки данных перед
выполнением операции преобразования типа.

In [238]:
df = pd.DataFrame({'Температура': ['−8 °C', '−10.3 °C', '−9.1 °C'], 'Давление': ['96292 Па', '97292 Па', '96325 Па'], 'Осадки': ['Да', 'Да', 'Нет'], 'Дата': ['2019-11-20', '2019-11-21', '2019-11-22']})

print(df, '\n')
print(df.dtypes)

  Температура  Давление Осадки        Дата
0       −8 °C  96292 Па     Да  2019-11-20
1    −10.3 °C  97292 Па     Да  2019-11-21
2     −9.1 °C  96325 Па    Нет  2019-11-22

Температура    object
Давление       object
Осадки         object
Дата           object
dtype: object

---

Типы всех полей - object, а нам нужно в первом столбце (Температура) float64, 

во втором - int64, 

в третьем - bool. 

Если мы попытаемся напрямую
выполнить приведение с помощью функции astype(), то эта операция завершиться неудачно, так как, например, для температуры, вместе с интересующим нас численным значением находится единица измерения.

Для решения этой задачи напишем несколько функций преобразования, которые помогут привести данные к нужному виду

In [240]:
temper_convertor = lambda x: x.replace('°C', '').replace('−', '-').strip() #strip убирает пробелы слева и справа
pressure_convertor = lambda x: x.replace('Па', '').strip()
prec_convertor = lambda x: True if x == 'Да' else False

In [241]:
df['Температура'] = df['Температура'].apply(temper_convertor).astype('float64')
df

   Температура  Давление Осадки        Дата
0         -8.0  96292 Па     Да  2019-11-20
1        -10.3  97292 Па     Да  2019-11-21
2         -9.1  96325 Па    Нет  2019-11-22

In [242]:
df['Давление'] = df['Давление'].apply(pressure_convertor).astype('int64')
df

   Температура  Давление Осадки        Дата
0         -8.0     96292     Да  2019-11-20
1        -10.3     97292     Да  2019-11-21
2         -9.1     96325    Нет  2019-11-22

In [243]:
df['Осадки'] = df['Осадки'].apply(prec_convertor)
df

   Температура  Давление  Осадки        Дата
0         -8.0     96292    True  2019-11-20
1        -10.3     97292    True  2019-11-21
2         -9.1     96325   False  2019-11-22

In [244]:
df.dtypes

Температура    float64
Давление         int64
Осадки            bool
Дата            object
dtype: object

---

#### Вспомогательные функции

---

Pandas предоставляет вспомогательные функции для преобразования данных, которые избавляют от необходимости разрабатывать соответствующие решения самим, таких функций три:

**to_numeric()** - преобразует данные в числовой тип;

**to_datetime()** - преобразует данные в тип datetime;

**to_timedelta()** - преобразует данные в тип timedelta.

In [251]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'Температура': ['-8 °C', '-10.3 °C', '-9.1 °C'], 'Давление': ['96292 Па', '97292 Па', '96325 Па'], 'Осадки': ['Да', 'Да', 'Нет'], 'Дата': ['2019-11-20', '2019-11-21', '2019-11-22']})

print(df, '\n')
print(df.dtypes)

  Температура  Давление Осадки        Дата
0       -8 °C  96292 Па     Да  2019-11-20
1    -10.3 °C  97292 Па     Да  2019-11-21
2     -9.1 °C  96325 Па    Нет  2019-11-22

Температура    object
Давление       object
Осадки         object
Дата           object
dtype: object

In [279]:
df['Температура'] = pd.to_numeric(df['Температура']) #If ‘coerce’, then invalid parsing will be set as NaN.
df['Давление'] = pd.to_numeric(df['Давление'], errors = 'coerce')
df['Дата'] = pd.to_timedelta(df['Дата'], errors = 'coerce')
print(df, '\n', df.dtypes)

#ЧЕВО КАВО

   Температура  Давление Осадки Дата
0          NaN       NaN     Да  NaT
1          NaN       NaN     Да  NaT
2          NaN       NaN    Нет  NaT
 Температура            float64
Давление               float64
Осадки                  object
Дата           timedelta64[ns]
dtype: object

#### Выборка данных по типу

In [250]:
df.select_dtypes(include = ['float64', 'int64'])

   Температура  Давление
0          NaN       NaN
1          NaN       NaN
2          NaN       NaN

---

**Категориальные типы. Работа с типом Categorical. Работа с Series**

---

pandas.Categorical(values, categories = None, ordered = None, dtype = None, fastpath = False)

- values : список

Элементы данных. Если дополнительно указывается категория
через параметр categories, то значения не из категории
заменяются на NaN.
- categories : набор уникальных элементов, None; значение по умолчанию: None

Задает набор значений, которые может принимать элементкатегории. Если равен None, то категория строится по набору уникальных элементов из параметра values.

- ordered : bool; значение по умолчанию: False

Определяет, является категория порядковой или нет. Если
значение равно True, то категория является порядковой.

- dtype : CategoricalDtype. 

Тип CategoricalDtype, который используется для категории.

In [281]:
s = pd.Series(['r', 'r', 'g', 'b']) #обычная серия строк
s

0    r
1    r
2    g
3    b
dtype: object

In [282]:
s = pd.Series(['r', 'r', 'g', 'b'], dtype = 'category') #серия категорий
s

0    r
1    r
2    g
3    b
dtype: category
Categories (3, object): ['b', 'g', 'r']

In [283]:
colors = pd.Categorical(['r', 'g', 'g', 'b', 'r']) #pd.Categorical
colors

['r', 'g', 'g', 'b', 'r']
Categories (3, object): ['b', 'g', 'r']

In [285]:
colors = pd.Categorical(['r', 'g', 'g', 'b', 'r'], categories = ['b', 'g', 'r']) #Явно указали категорию
colors

['r', 'g', 'g', 'b', 'r']
Categories (3, object): ['b', 'g', 'r']

In [286]:
colors = pd.Categorical(['r', 'g', 'g', 'b', 'r', 'y', 'o'], categories=['r', 'g', 'b']) #указали элементы для которых нет кат
colors

['r', 'g', 'g', 'b', 'r', NaN, NaN]
Categories (3, object): ['r', 'g', 'b']

In [287]:
colors_s = pd.Series(colors)
colors_s

0      r
1      g
2      g
3      b
4      r
5    NaN
6    NaN
dtype: category
Categories (3, object): ['r', 'g', 'b']

In [288]:
colors_s = pd.Series(colors).dropna() #минус NA
colors_s

0    r
1    g
2    g
3    b
4    r
dtype: category
Categories (3, object): ['r', 'g', 'b']

**Категориальные типы. Работа с типом Categorical. Работа с DataFrame**

In [290]:
df = pd.DataFrame({'C1': list('rrg'), 'C2': list('rgb')}, dtype = 'category')
print(df, '\n', df.dtypes)

  C1 C2
0  r  r
1  r  g
2  g  b
 C1    category
C2    category
dtype: object

**Порядковые категории**

Категориальные данные, о которых шла речь выше, не включают в себя отношение порядка, то есть для переменных, принимающих значения из таких категорий **невозможно выполнить сравнение “больше-меньше”**.

Существуют категории, для которых отношение порядка задается, это может быть роль в фильме, образование и т.п.

In [297]:
level = pd.Categorical(['h', 'h', 'm', 'l'], categories = ['h', 'm', 'l'], ordered = True) #ordered - по порядку
level

['h', 'h', 'm', 'l']
Categories (3, object): ['h' < 'm' < 'l']

In [294]:
level.min()

'h'

In [295]:
level = pd.Categorical(['h', 'h', 'm', 'l'], categories = ['h', 'm', 'l'], ordered = False) #ordered - по порядку
level

['h', 'h', 'm', 'l']
Categories (3, object): ['h', 'm', 'l']

In [296]:
level.min() #ошибка

TypeError: Categorical is not ordered for operation min
you can use .as_ordered() to change the Categorical to an ordered one

In [298]:
level = pd.Categorical(['h', 'h', 'm', 'l'], categories = ['h', 'm', 'l'], ordered = True) #ordered - по порядку

lev_var = pd.Series(level)

print('min: {}, max: {}'.format(lev_var.min(), lev_var.max())) # .format(1, 2, 3 ...)

min: h, max: l

In [299]:
c1 = pd.Series(pd.Categorical(['r', 'g', 'b', 'r'], categories=['r','g', 'b'], ordered=False))

c2 = pd.Series(pd.Categorical(['b', 'g', 'g', 'r'], categories=['r','g', 'b'], ordered=False))

c1 > c2 #ошибка

TypeError: Unordered Categoricals can only compare equality or not

In [300]:
v1 = pd.Series(pd.Categorical(['h', 'm', 'l', 'h'], categories=['l','m', 'h'], ordered=True))

v2 = pd.Series(pd.Categorical(['m', 'm', 'h', 'l'], categories=['l','m', 'h'], ordered=True))

v1 > v2

0     True
1    False
2    False
3     True
dtype: bool

---

# Глава 4. Работа с пропусками в данных

---

В данных могут быть пропуски. 

Для того, чтобы можно было использовать алгоритмы машинного обучения, строящие модели по этим данным, необходимо эти пропуски заполнить. 

На вопрос “чем заполнять?” мы не будем отвечать в рамках данной книги, т.к. он относится больше к теме машинного обучения и анализа данных. 

А вот на вопрос “как заполнять?” мы ответим, и решать эту задачу будем средствами библиотеки pandas, которая предоставляет инструменты, позволяющие это сделать.

In [2]:
import pandas as pd
from io import StringIO #стр 48

In [3]:
data = 'price,count,percent\n1,10,\n2,20,51\n3,30,'
df = pd.read_csv(StringIO(data))
df

   price  count  percent
0      1     10      NaN
1      2     20     51.0
2      3     30      NaN

In [4]:
df.loc[3] = {'price': 4, 'count': None, 'percent': 26.3}
df

   price count  percent
0      1    10      NaN
1      2    20     51.0
2      3    30      NaN
3      4  None     26.3

In [8]:
pd.isnull(df) #Таблица bool (boolean - логический)

   price  count  percent
0  False  False     True
1  False  False    False
2  False  False     True
3  False   True    False

In [9]:
df.isnull()

   price  count  percent
0  False  False     True
1  False  False    False
2  False  False     True
3  False   True    False

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   price    4 non-null      int64
 1   count    3 non-null      object
 2   percent  2 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 128.0+ bytes

In [13]:
print(df, '\n'*2)

df.isnull().sum()

   price count  percent
0      1    10      NaN
1      2    20     51.0
2      3    30      NaN
3      4  None     26.3

price      0
count      1
percent    2
dtype: int64

In [14]:
print(df, '\n'*2)
df.fillna(0)

   price count  percent
0      1    10      NaN
1      2    20     51.0
2      3    30      NaN
3      4  None     26.3

   price  count  percent
0      1     10      0.0
1      2     20     51.0
2      3     30      0.0
3      4      0     26.3

In [16]:
df.fillna(df.mean())

   price  count  percent
0      1   10.0    38.65
1      2   20.0    51.00
2      3   30.0    38.65
3      4   20.0    26.30

In [19]:
df.dropna() #удаление строк, где присутствует >=1 NaN

   price count  percent
1      2    20     51.0

In [24]:
df.dropna(axis = 1) #удаление столбцов, где присутствует >=1 NaN

   price
0      1
1      2
2      3
3      4

In [29]:
print(df, '\n'*2)
df.dropna(axis = 1, thresh = 3) #thresh - количество не-NaN Элементов

   price count  percent
0      1    10      NaN
1      2    20     51.0
2      3    30      NaN
3      4  None     26.3

   price count
0      1    10
1      2    20
2      3    30
3      4  None

---

# Глава 5. Работа со структурами данных в pandas: удаление, объединение, расширение, группировка

---

- **Добавление элементов в структуру pandas**
- **Добавление в Series**
- **Добавление в DataFrame**

In [32]:
#Структура Series
s = pd.Series([1, 2, 3, 4, 5], ['A', 'B', 'C', 'D', 'E'])
#Словарь для DataFrame
d = {'color':['red', 'green', 'blue'], 'speed': [56, 24, 65], 'volume': [80, 65, 50]}
#Структура DataFrame
df = pd.DataFrame(d)
df

   color  speed  volume
0    red     56      80
1  green     24      65
2   blue     65      50

In [33]:
s['F'] = 6
s

A    1
B    2
C    3
D    4
E    5
F    6
dtype: int64

In [34]:
df['type'] = ['circle', 'square', 'triangle']
df

   color  speed  volume      type
0    red     56      80    circle
1  green     24      65    square
2   blue     65      50  triangle

In [35]:
df['value'] = 7
df

   color  speed  volume      type  value
0    red     56      80    circle      7
1  green     24      65    square      7
2   blue     65      50  triangle      7

In [37]:
new_row = pd.Series(['yellow', 34, 10, 'rectangle', 7], ['color', 'speed', 'volume', 'type', 'value'])
new_row

color        yellow
speed            34
volume           10
type      rectangle
value             7
dtype: object

In [39]:
df.append(new_row, ignore_index = True)
df

   color  speed  volume      type  value
0    red     56      80    circle      7
1  green     24      65    square      7
2   blue     65      50  triangle      7

#### Удаление элементов из структуры в pandas

In [43]:
#Структура Series
s = pd.Series([1, 2, 3, 4, 5], ['A', 'B', 'C', 'D', 'E'])
#Словарь для DataFrame
d = {'color':['red', 'green', 'blue'], 'speed': [56, 24, 65], 'volume': [80, 65, 50]}
#Структура DataFrame
df = pd.DataFrame(d)
print(s, '\n'*3, df)

A    1
B    2
C    3
D    4
E    5
dtype: int64


    color  speed  volume
0    red     56      80
1  green     24      65
2   blue     65      50

In [44]:
s_new = s.drop(['A', 'B'])
s_new

C    3
D    4
E    5
dtype: int64

In [45]:
s.drop(['A', 'B'], inplace = True)
s

C    3
D    4
E    5
dtype: int64

In [51]:
df.iloc[0]

color     red
speed      56
volume     80
Name: 0, dtype: object

In [52]:
df_new = df.drop([0])
df_new

   color  speed  volume
1  green     24      65
2   blue     65      50

In [53]:
df.drop([0], inplace = True)
df

   color  speed  volume
1  green     24      65
2   blue     65      50

In [54]:
#Создание тестовое, Словарь для DataFrame
d = {'color':['red', 'green', 'blue'], 'speed': [56, 24, 65], 'volume': [80, 65, 50]}
#Структура DataFrame
df = pd.DataFrame(d)
df['type'] = ['circle', 'square', 'triangle']
df['value'] = 7
df

   color  speed  volume      type  value
0    red     56      80    circle      7
1  green     24      65    square      7
2   blue     65      50  triangle      7

In [58]:
df.drop(['color', 'value'], axis = 1, inplace = True)
df

   speed  volume      type
0     56      80    circle
1     24      65    square
2     65      50  triangle

---

##  Объединение данных

---

**Использование метода concat**

pandas.concat(objs, axis=0, join='outer', join_axes=None, ignore_index=False, keys=None, levels=None, names=None, verify_integrity=False, copy=True)

- objs: массив или словарь структур Series, DataFrame или Panel.

Структуры для объединения.

- axis: 0 - строки, 1 - столбцы; значение по умолчанию: 0

Ось, вдоль которой будет производиться объединение.

- join: {'inner', 'outer'}; значение по умолчанию: 'outer'

Тип операции объединения, 'outer' - итоговая структура будет результатом объединения (логическое ИЛИ) переданных структур, 'inner' - итоговая структура будет результатом
пересечения (логическое И) переданных структур.

- ignore_index: bool; значение по умолчанию: False

True — не используется значение индекса в процессе
объединения, False – используется.

In [62]:
dfr1 = pd.DataFrame({'a_type':['a1', 'a2', 'a3'], 'b_type':['b1', 'b2', 'b3'], 'c_type':['c1', 'c2', 'c3']}, index=[0, 1, 2])
dfr2 = pd.DataFrame({'a_type':['a4', 'a5', 'a6'], 'b_type':['b4', 'b5', 'b6'], 'c_type':['c4', 'c5', 'c6']}, index=[3, 4, 5])
df = pd.concat([dfr1, dfr2])
df

  a_type b_type c_type
0     a1     b1     c1
1     a2     b2     c2
2     a3     b3     c3
3     a4     b4     c4
4     a5     b5     c5
5     a6     b6     c6

In [63]:
dfr3 = pd.DataFrame({'d_type':['d1', 'd2', 'd3'], 'e_type':['e1', 'e2', 'e3']})
dfr3

  d_type e_type
0     d1     e1
1     d2     e2
2     d3     e3

In [64]:
df2 = pd.concat([dfr1, dfr3], axis = 1)
df2

  a_type b_type c_type d_type e_type
0     a1     b1     c1     d1     e1
1     a2     b2     c2     d2     e2
2     a3     b3     c3     d3     e3

In [68]:
df3 = pd.concat([dfr1, dfr2], keys = ['jopa_1', 'jopa_2'])
df3

         a_type b_type c_type
jopa_1 0     a1     b1     c1
       1     a2     b2     c2
       2     a3     b3     c3
jopa_2 3     a4     b4     c4
       4     a5     b5     c5
       5     a6     b6     c6

In [69]:
df3.loc['jopa_2']

  a_type b_type c_type
3     a4     b4     c4
4     a5     b5     c5
5     a6     b6     c6

In [71]:
dfr4 = pd.DataFrame({'d_type':['d2', 'd3', 'd4'], 'e_type':['e2', 'e3', 'e4']}, index=[1, 2, 3])
dfr4

  d_type e_type
1     d2     e2
2     d3     e3
3     d4     e4

In [73]:
dfr1

  a_type b_type c_type
0     a1     b1     c1
1     a2     b2     c2
2     a3     b3     c3

In [76]:
df4 = pd.concat([dfr1, dfr4], axis = 1, join = 'outer')
df4

  a_type b_type c_type d_type e_type
0     a1     b1     c1    NaN    NaN
1     a2     b2     c2     d2     e2
2     a3     b3     c3     d3     e3
3    NaN    NaN    NaN     d4     e4

In [75]:
df5 = pd.concat([dfr1, dfr4], axis = 1, join = 'inner')
df5

  a_type b_type c_type d_type e_type
1     a2     b2     c2     d2     e2
2     a3     b3     c3     d3     e3

**Использование Database-style подхода**

Суть подхода в том, что используется быстрый способ объединения структур данных, идеологически похожий на операции с реляционными БД. 

В состав pandas входит функция **merge**, которая представляет данный функционал

pandas.merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=True, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None)

- left: DataFrame

“левая” DataFrame структура.
- right: DataFrame

“правая” DataFrame структура.
- how: {'left', 'right', 'outer', 'inner'}; значение по умолчанию: 'inner'

◦ Один из методов объединения: 'left', 'right', 'outer','inner':

- 'left' - это аналог SQL операции 'LEFT OUTER JOIN' при этом будут использоваться ключи только из левого DataFrame.
- 'right' - аналог SQL операции 'RIGHT OUTER JOIN' - используются ключи из правого DataFrame.
- 'outer' - аналог SQL операции 'FULL OUTER JOIN' - используется объединение ключей из правого и левого DataFrame.
- 'inner' - аналог SQL операции 'INNER JOIN' - используется пересечение ключей из правого и левого DataFrame.


- on: список

Список имен столбцов для объединения, столбцы должны
входить как в левый, так и в правый DataFrame.

- left_on: список

Список столбцов левого DataFrame, которые будут
использоваться как ключи.

- right_on: список

Список столбцов из правого DataFrame, которые будут
использоваться как ключи.

- left_index: bool; значение по умолчанию: False

Если параметр равен True, то будет использован индекс (метки
строк) из левого DataFrame в качестве ключа(ей) для
объединения.

- right_index: bool; значение по умолчанию: False

Если параметр равен True, то будет использован индекс (метки
строк) из правого DataFrame в качестве ключа(ей) для
объединения.

- sort: bool; значение по умолчанию: False

Если параметр равен True, то данные в полученном DataFrame
будут отсортированы в лексикографическом порядке.

In [79]:
dfr1 = pd.DataFrame({'k':['k1', 'k2', 'k3'], 'a_type':['a1', 'a2', 'a3'], 'b_type':['b1', 'b2', 'b3']})
dfr2 = pd.DataFrame({'k':['k1', 'k2', 'k3'], 'c_type':['c1', 'c2', 'c3']})
dfr3 = pd.DataFrame({'k':['k0', 'k1', 'k2'], 'c_type':['c1', 'c2', 'c3']})

print(dfr1,dfr2,dfr3, sep = '\n'*2)

    k a_type b_type
0  k1     a1     b1
1  k2     a2     b2
2  k3     a3     b3

    k c_type
0  k1     c1
1  k2     c2
2  k3     c3

    k c_type
0  k0     c1
1  k1     c2
2  k2     c3

In [80]:
# По дефолту - INNER
dfm1 = pd.merge(dfr1, dfr2, on = 'k')
dfm1

    k a_type b_type c_type
0  k1     a1     b1     c1
1  k2     a2     b2     c2
2  k3     a3     b3     c3

In [81]:
# Пример использования how='left'
dfm2 = pd.merge(dfr1, dfr3, how='left', on='k')
dfm2

    k a_type b_type c_type
0  k1     a1     b1     c2
1  k2     a2     b2     c3
2  k3     a3     b3    NaN

In [82]:
# Пример использования how='right'
dfm3 = pd.merge(dfr1, dfr3, how='right', on='k')
dfm3

    k a_type b_type c_type
0  k0    NaN    NaN     c1
1  k1     a1     b1     c2
2  k2     a2     b2     c3

In [83]:
# Пример использования how='outer'
dfm4 = pd.merge(dfr1, dfr3, how='outer', on='k')
dfm4

    k a_type b_type c_type
0  k1     a1     b1     c2
1  k2     a2     b2     c3
2  k3     a3     b3    NaN
3  k0    NaN    NaN     c1

In [84]:
dfm1 = pd.merge(dfr1, dfr3, on = 'k')
dfm1

    k a_type b_type c_type
0  k1     a1     b1     c2
1  k2     a2     b2     c3

In [85]:
#Пример использования how='inner'
dfm5 = pd.merge(dfr1, dfr3, how='inner', on='k')
dfm5

    k a_type b_type c_type
0  k1     a1     b1     c2
1  k2     a2     b2     c3

---

# Глава 6. Работа с внешними источниками данных

---

**CSV (Comma-Separated Values - значения, разделённые запятыми)** является одним из наиболее популярных форматов для хранения табличных данных, представляет собой текстовый документ, в котором элементы данных разделены запятыми, а строки файла являются записями в таблице.

###  Чтение данных

**read_csv()**

- filepath_or_buffer: str1

Путь до файла или буфера, который содержит данные в
формате CSV.

- sep: str; значение по умолчанию: ','

Разделитель, по умолчанию он равен ',', т.к. в CSV данные
разделены запятыми. Довольно часто встречается вариант,
когда данные разделяются табуляцией, так называемые TSVфайлы, если вы используете такой формат, то необходимо
параметру sep присвоить значение '\t'.

- header: int или список int’ов; значение по умолчанию: 0

Номер строки, которая содержит имена столбцов загружаемой
таблицы. По умолчанию header=0. Если header=None, то имена
столбцов можно передать в параметре names.

- names: массив; значение по умолчанию: None

Список имен столбцов таблицы, используется, если в файле нет
строки с именами столбцов и параметр header равен None.

In [ ]:
import pandas as pd
from io import StringIO

In [86]:
csv_d1 = 'col_A, col_B, col_C\na1, b1, c1\na2, b2, c2'
df = pd.read_csv(StringIO(csv_d1))
df

  col_A  col_B  col_C
0    a1     b1     c1
1    a2     b2     c2

В приведенном выше примере в первой строке набора данных содержатся заголовки колонок таблицы. Но не всегда бывает так. Ниже приведен случай, когда в таблице с данными нет информации об именах столбцов, эту ситуацию можно исправить, если параметру **header присвоить None и передать нужные значения через параметр names**.

In [87]:
csv_d2 = 'a1, b1, c1\na2, b2, c2\na3, b3, c3'
df1 = pd.read_csv(StringIO(csv_d2), header=None, names=['type_a', 'type_b', 'type_c'])
df1

  type_a type_b type_c
0     a1     b1     c1
1     a2     b2     c2
2     a3     b3     c3

В случае, когда размер файла очень большой и его невозможно загрузить за одни раз в память (DataFrame), воспользуйтесь загрузкой по частям. Для этого нужно в функцию read_csv() дополнительно передать параметр **chunksize**, через который указывается количество строк, которые нужно считать в рамках одной порции. Такой подход позволяет работать с DataFrame'ами как с итераторами.

In [ ]:
df_chunks = pd.read_csv('test.csv', chunksize=2)

for i, chunk in enumerate(df_chunks):
    print(f'Chunk #{i}')
    print(chunk)

In [ ]:
df_chunks = pd.read_csv('test.csv', chunksize=2)

print(df_chunks.get_chunk()) #ps - Странциа 72

**to_csv()**

- path_or_buf: str или handle файла; значение по умолчанию: None

Имя файла или буфера, в котором будут сохранены данные в
формате CSV.

- sep: str; значение по умолчанию: ','

Разделитель элементов данных, по умолчанию sep=','.

- header: bool или список строк; значение по умолчанию: True

Если в качестве значения передается True, то в файл первой строкой запишутся имена столбцов, взятые из структуры данных. Если будет передан список строк, то имена столбцов будут взяты из него.

- encoding: str

Кодировка. Если вы используете Python 3, то по умолчанию она
равна 'utf-8'.

**Работа с данными в формате JSON**